       IDENTIFICATION DIVISION.
       PROGRAM-ID. LINKAGESRC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Define a variable to link from another file.
       01 FULLNAME PIC X(32) VALUE "John Smith".